Revit 2026 API

# SelectionFilterElementRemoveSet Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int RemoveSet(
	ICollection<ElementId> ids
)
```
```vb
Public Function RemoveSet (
	ids As ICollection(Of ElementId)
) As Integer
```
```cpp
public:
int RemoveSet(
	ICollection<ElementId^>^ ids
)
```
```fsharp
member RemoveSet :
        ids : ICollection<ElementId> -> int
```

#### Parameters

ids ICollectionElementId

#### Return Value

Int32

#### Reference

SelectionFilterElement Class

Autodesk.Revit.DB Namespace